#pragma once
#include <SFML\Graphics.hpp>
class Map
{
private:
	int HEIGHT_MAP = 25;//размер карты высота
	int WIDTH_MAP = 40;//размер карты ширина 
	sf::String TileMap[25] = {
	"0000000000000000000000000000000000000000",
	"0                                      0",
	"0   s                                  0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0000000000000000000000000000000000000000",
	};
public:
	sf::String* GetMap() {
		return TileMap;
	}
};

